Repository: fieldcure/fieldcure-assiststudio
Catalog: src/AssistStudio/Strings/*/Resources.resw
Source language: en_us
Languages: ko_kr

# Menu_New.Text
source: New
ko_kr: 새로 만들기

# Menu_Open.Text
source: Open...
ko_kr: 불러오기...

# Menu_RecentConversations.Text
source: Recent Conversations
ko_kr: 최근 대화

# Menu_Save.Text
source: Save
ko_kr: 저장

# Menu_SaveAs.Text
source: Save As...
ko_kr: 다른 이름으로 저장...

# Menu_SaveAll.Text
source: Save All
ko_kr: 모두 저장

# Menu_ExportMarkdown.Text
source: Export as Markdown
ko_kr: Markdown으로 내보내기

# Menu_ExportToFile.Text
source: Save to file...
ko_kr: 파일로 저장...

# Menu_ExportToClipboard.Text
source: Copy to clipboard
ko_kr: 클립보드로 복사

# Menu_Settings.Text
source: Settings
ko_kr: 설정

# Export_Success
source: Markdown exported
ko_kr: Markdown 내보내기 완료

source: Export failed
ko_kr: 내보내기 실패

# Export_AccessDenied
source: Access denied. Check Controlled Folder Access settings.
ko_kr: 접근이 거부되었습니다. 제어된 폴더 액세스 설정을 확인하세요.

# Export_Copied
source: Copied to clipboard
ko_kr: 클립보드에 복사됨

# Export_ReadyToPaste
source: Ready to paste
ko_kr: 붙여넣기 가능

# Export_MediaNotIncluded
source: {0} media file(s) not included
ko_kr: 미디어 {0}개 미포함

# Menu_ClearRecentHistory
source: Clear Recent History
ko_kr: 최근 기록 지우기

# Menu_NoRecentConversations
source: No recent conversations
ko_kr: 최근 대화 없음

# Dialog_SaveConversation
source: Save conversation?
ko_kr: 대화를 저장하시겠습니까?

# Dialog_SaveConversationContent
source: Do you want to save this conversation before closing?
ko_kr: 닫기 전에 이 대화를 저장하시겠습니까?

# Dialog_Save
source: Save
ko_kr: 저장

# Dialog_DontSave
source: Don't Save
ko_kr: 저장 안 함

# Dialog_Cancel
source: Cancel
ko_kr: 취소

# Dialog_OK
source: OK
ko_kr: 확인

# Dialog_RenameConversation
source: Rename Conversation
ko_kr: 대화 이름 변경

# Dialog_UnsavedChanges
source: Unsaved Changes
ko_kr: 저장되지 않은 변경 사항

# Dialog_UnsavedChangesContent
source: You have {0} unsaved conversation(s). Save before closing?
ko_kr: 저장되지 않은 대화가 {0}개 있습니다. 종료 전에 저장하시겠습니까?

# Dialog_SaveAllExit
source: Save All & Exit
ko_kr: 모두 저장 후 종료

# Dialog_DiscardExit
source: Discard & Exit
ko_kr: 저장하지 않고 종료

# Nav_Models.Content
source: Models
ko_kr: 모델

# Nav_Memory.Content
source: Memory
ko_kr: 메모리

# Nav_Personalization.Content
source: Personalization
ko_kr: 개인 설정

# Nav_Profiles.Content
source: Profiles
ko_kr: 프로필

# Nav_Advanced.Content
source: Advanced
ko_kr: 고급 설정

# Nav_About.Content
source: About
ko_kr: 정보

# Models_Title.Text
source: Models
ko_kr: 모델

# Models_CloudSection.Text
source: Cloud models
ko_kr: 클라우드 모델

# Models_ApiKeyStorageInfo.Text
source: API keys are encrypted and stored securely on this device.
ko_kr: API 키는 이 기기에 암호화하여 저장됩니다.

# Models_LocalSection.Text
source: Local models
ko_kr: 로컬 모델

# Models_DefaultModel.Text
source: Default model
ko_kr: 기본 모델

# Models_ApiKeyBox.PlaceholderText
source: API Key
ko_kr: API 키

# Models_ModelNotAvailable.PlaceholderText
source: Not available
ko_kr: 사용 불가

# Models_RefreshStatus.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Check status
ko_kr: 상태 확인

# Models_DownloadOllama.Content
source: Download Ollama
ko_kr: Ollama 다운로드

# Models_BrowsePullModels.Content
source: Browse models
ko_kr: 모델 찾아보기

# Models_OllamaLogin.Content
source: Ollama Login
ko_kr: Ollama 로그인

# Models_OllamaDefaultModel.Header
source: Default model
ko_kr: 기본 모델

# Models_OllamaCloudHint.Text
source: Sign in required for cloud models (:cloud). Clicking Login opens a command prompt — complete authentication in your browser.
ko_kr: 클라우드 모델(:cloud) 사용 시 로그인이 필요합니다. 로그인 버튼을 누르면 명령 프롬프트 창이 열리고, 브라우저에서 인증을 완료하세요.

# Memory_Title.Text
source: Memory
ko_kr: 메모리

# Memory_Empty.Text
source: No memories saved yet.
ko_kr: 저장된 메모리가 없습니다.

# Memory_EmptyHint.Text
source: Say "remember this" during a conversation and the AI will save it.
ko_kr: 대화 중 "이것을 기억해줘"라고 말하면 AI가 기억합니다.

# Memory_Counter
source: {0} / {1} entries
ko_kr: {0} / {1}개

# Memory_Connecting
source: Connecting to memory service…
ko_kr: 메모리 서비스에 연결 중…

# Memory_DeleteTooltip
source: Delete
ko_kr: 삭제

# Memory_Hint.Text
source: Memories are saved during conversations. Ask the AI to remember or forget information.
ko_kr: AI가 대화에서 기억한 정보입니다. 대화 중 기억하거나 잊도록 요청할 수 있습니다.

# Personalization_Title.Text
source: Personalization
ko_kr: 개인 설정

# Personalization_Theme.Text
source: Theme
ko_kr: 테마

# Personalization_System.Content
source: System
ko_kr: 시스템

# Personalization_Light.Content
source: Light
ko_kr: 밝게

# Personalization_Dark.Content
source: Dark
ko_kr: 어둡게

# Profiles_Title.Text
source: Profiles
ko_kr: 프로필

# Profiles_Description.Text
source: Create profiles with different instructions, model preferences, and tool permissions.
ko_kr: 지시사항, 모델 설정, 도구 권한이 다른 프로필을 만들어 보세요.

# Profiles_Instructions.PlaceholderText
source: Enter instructions...
ko_kr: 지시사항을 입력하세요...

# Profiles_List.Text
source: Profiles
ko_kr: 프로필

# Profiles_AddProfile.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Add profile
ko_kr: 프로필 추가

# Profiles_DeleteProfile.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Delete
ko_kr: 삭제

# Profiles_ResetProfile
source: Reset to defaults
ko_kr: 기본값으로 리셋

# Profiles_ProfileName.Header
source: Name
ko_kr: 이름

# Profiles_ProfileName.PlaceholderText
source: Profile name
ko_kr: 프로필 이름

# Profiles_Instructions.Header
source: Instructions
ko_kr: 지시사항

# Profiles_NewProfileDialog
source: New Profile
ko_kr: 새 프로필

# Profiles_DesiredProvider.Text
source: Desired provider
ko_kr: 선호 프로바이더

# Profiles_DesiredModel.Text
source: Desired model
ko_kr: 선호 모델

# Profiles_DesiredTools.Text
source: Tools & Servers
ko_kr: 도구 및 서버

# Profiles_ToolsDefaultHint
source: Selected servers will be the default for new conversations.
ko_kr: 여기서 선택한 서버가 새 대화의 기본값이 됩니다.

# Profiles_ServerToolsHint
source: Server tools are automatically discovered and used by AI.
ko_kr: 서버의 도구는 AI가 자동으로 검색하여 사용합니다.

# Profiles_AnyProvider
source: Any provider
ko_kr: 모든 프로바이더

# Nav_AppTasks.Content
source: App Tasks
ko_kr: 앱 작업

# AppTasks_Title.Text
source: App Tasks
ko_kr: 앱 작업

# AppTasks_Description.Text
source: Choose which model the app uses for background tasks such as title generation, conversation summaries, and sub-agent execution.
ko_kr: 제목 생성, 대화 요약, 서브에이전트 실행 등 백그라운드 작업에 사용할 모델을 선택합니다.

# AppTasks_TitleSection.Header
source: Title generation
ko_kr: 대화 제목 자동 생성

# AppTasks_SummarySection.Header
source: Summary
ko_kr: 긴 대화 자동 요약

# AppTasks_SubAgentSection.Header
source: Sub-Agent
ko_kr: 서브에이전트

# TaskPreset_ProviderSettings.Text
source: Provider settings
ko_kr: 프로바이더 설정

# TaskPreset_Inherit.Content
source: Inherit from conversation
ko_kr: 대화에서 상속

# TaskPreset_Specific.Content
source: Use a specific provider
ko_kr: 특정 프로바이더 사용

# TaskPreset_Provider.Header
source: Provider
ko_kr: 프로바이더

# AppTasks_AutoTitle.Header
source: Generate conversation titles automatically
ko_kr: 대화 제목 자동 생성

# AppTasks_AutoSummary.Header
source: Summarize long conversations automatically
ko_kr: 긴 대화 자동 요약

# AppTasks_MaxInputTokens.Header
source: Summary threshold (tokens)
ko_kr: 요약 임계값 (토큰)

# AppTasks_MaxInputTokensHint.Text
source: When input tokens exceed this value, prior conversation is summarized automatically. Set below your model's context limit.
ko_kr: 입력 토큰이 이 값을 넘으면 이전 대화를 자동으로 요약합니다. 사용 중인 모델의 컨텍스트 한도보다 작게 설정하세요.

# Advanced_Title.Text
source: Advanced
ko_kr: 고급 설정

# Advanced_Language.Text
source: Language
ko_kr: 언어

# Advanced_LanguageDescription.Text
source: Override the system default language. Changes take effect after restarting the app.
ko_kr: 시스템 기본 언어를 무시하고 사용자 지정 언어를 선택합니다. 변경 사항을 적용하려면 앱을 다시 시작해야 합니다.

# Advanced_Restart.Text
source: Please restart the app to apply the language change.
ko_kr: 언어 변경을 적용하려면 앱을 다시 시작해 주세요.

# Advanced_Logging.Text
source: Logging
ko_kr: 로깅

# Advanced_LoggingDescription.Text
source: Application logs are stored locally for troubleshooting.
ko_kr: 문제 해결을 위해 앱 로그가 로컬에 저장됩니다.

# Advanced_OpenLogsFolder.Content
source: Open logs folder
ko_kr: 로그 폴더 열기

# About_Title.Text
source: About
ko_kr: 정보

# About_Description.Text
source: AI Chat UI Control for WinUI 3.
ko_kr: WinUI 3용 AI 채팅 UI 컨트롤.

# About_Providers.Text
source: Supports Claude, OpenAI, Ollama, Gemini, Groq and more.
ko_kr: Claude, OpenAI, Ollama, Gemini, Groq 등을 지원합니다.

# About_License.Text
source: License
ko_kr: 라이선스

# About_MITLicense.Text
source: MIT License
ko_kr: MIT 라이선스

# About_Links.Text
source: Links
ko_kr: 링크

# About_GitHubRepo.Content
source: GitHub Repository
ko_kr: GitHub 저장소

# About_SystemSpec.Text
source: System Specification
ko_kr: 시스템 사양

# Models_StartOllama.Content
source: Start Ollama
ko_kr: Ollama 시작

# Models_NoKey
source: No Key
ko_kr: 키 없음

# Models_UpdateKey
source: Update Key
ko_kr: 키 수정

# Models_AddKey
source: Add Key
ko_kr: 키 추가

# Models_Checking
source: Checking...
ko_kr: 확인 중...

# Models_Running
source: Running
ko_kr: 실행 중

# Models_InstalledNotRunning
source: Installed (not running)
ko_kr: 설치됨 (미실행)

# Models_NotInstalled
source: Not installed
ko_kr: 미설치

# Models_Error
source: Error
ko_kr: 오류

# Models_Starting
source: Starting...
ko_kr: 시작 중...

# Models_FailedToStart
source: Failed to start
ko_kr: 시작 실패

# Models_ErrorStarting
source: Error starting
ko_kr: 시작 오류

# Models_FitMaybe
source: may be slow
ko_kr: 느릴 수 있음

# Models_PullingModel
source: Downloading {0}...
ko_kr: {0} 다운로드 중...

# Models_AddKeyButton.Content
source: Add
ko_kr: 추가

# Models_RemoveKey.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Remove Key
ko_kr: 키 삭제

# Models_PdfHandling.Text
source: PDF handling
ko_kr: PDF 처리

# Models_PdfAuto
source: Auto
ko_kr: 자동

# Models_PdfNative
source: Native PDF
ko_kr: 네이티브 PDF

# Models_PdfPageAsImage
source: Page as Image
ko_kr: 이미지 변환

# Models_PdfTextExtraction
source: Text Extraction
ko_kr: 텍스트 추출

# ModelDialog.Title
source: Ollama Models
ko_kr: Ollama 모델

# ModelDialog.CloseButtonText
source: Close
ko_kr: 닫기

# ModelDialog_LocalModels.Text
source: Local Models
ko_kr: 로컬 모델

# ModelDialog_LocalModelsSection.Header
source: Local Models
ko_kr: 로컬 모델

# ModelDialog_NoLocalModels.Text
source: No models downloaded yet. Download from the list below.
ko_kr: 다운로드된 모델이 없습니다. 아래 목록에서 모델을 다운로드하세요.

# ModelDialog_AvailableModels.Text
source: Recommended Models
ko_kr: 추천 모델

# ModelDialog_AvailableModelsSection.Header
source: Recommended Models
ko_kr: 추천 모델

# ModelDialog_Delete.Content
source: Delete
ko_kr: 삭제

# ModelDialog_DeleteTooltip
source: Delete
ko_kr: 삭제

# ModelDialog_DownloadTooltip
source: Download
ko_kr: 다운로드

# ModelDialog_PullCustomBtn.ToolTipService.ToolTip
source: Download
ko_kr: 다운로드

# ModelDialog_DeleteConfirmTitle
source: Delete Model
ko_kr: 모델 삭제

# ModelDialog_DeleteConfirmMessage
source: Delete '{0}'?
ko_kr: '{0}' 모델을 삭제하시겠습니까?

# ModelDialog_Cancel
source: Cancel
ko_kr: 취소

# ModelDialog_Pull.Content
source: Download
ko_kr: 다운로드

# ModelDialog_CustomModel.PlaceholderText
source: Ollama library model name (e.g. phi3:medium)
ko_kr: Ollama 라이브러리 모델명 (예: phi3:medium)

# ModelDialog_PullCustom.Content
source: Download
ko_kr: 다운로드

# ModelDialog_Queued
source: Queued
ko_kr: 대기 중

# ModelDialog_DownloadHint.Text
source: Selected models will start downloading after this dialog is closed.
ko_kr: 선택한 모델은 이 창을 닫은 후 다운로드가 시작됩니다.

# ModelDialog_VramWarningTitle
source: Insufficient VRAM
ko_kr: VRAM 부족

# ModelDialog_VramWarningMessage
source: This model may not run properly due to insufficient VRAM. Do you want to download it anyway?
ko_kr: VRAM이 부족하여 이 모델이 정상적으로 실행되지 않을 수 있습니다. 계속 다운로드하시겠습니까?

# ModelDialog_VramWarningContinue
source: Download Anyway
ko_kr: 계속 다운로드

# ModelDialog_VramWarningTip.Title
source: Insufficient VRAM
ko_kr: VRAM 부족

# ModelDialog_VramWarningTip.Subtitle
source: This model may not run properly due to insufficient VRAM.
ko_kr: VRAM이 부족하여 이 모델이 정상적으로 실행되지 않을 수 있습니다.

# ModelDialog_VramWarningContinueText.Text
source: Download Anyway
ko_kr: 계속 다운로드

# Tab_NewConversation
source: Untitled
ko_kr: 새 대화

# Tool_read_file
source: Read File
ko_kr: 파일 읽기

# Tool_write_file
source: Write File
ko_kr: 파일 쓰기

# Tool_search_files
source: Search Files
ko_kr: 파일 검색

# Tool_run_command
source: Run Command
ko_kr: 명령 실행

# Tool_fetch_url
source: Fetch URL
ko_kr: URL 가져오기

# Tool_remember
source: Remember
ko_kr: 기억하기

# Tool_forget
source: Forget
ko_kr: 잊기

# CollapsibleSection_CollapseTooltip
source: Collapse section
ko_kr: 섹션 접기

# CollapsibleSection_ExpandTooltip
source: Expand section
ko_kr: 섹션 펼치기

# Models_ThinkingNotSupported
source: This model does not support extended reasoning.
ko_kr: 이 모델은 확장 추론을 지원하지 않습니다.

# Models_ThinkingAlwaysOn
source: This model always has reasoning enabled.
ko_kr: 이 모델은 항상 추론이 활성화됩니다.

# Models_ThinkingOverride.Header
source: Reasoning mode
ko_kr: 추론 모드

# Models_ExtendedThinking.Header
source: Extended reasoning
ko_kr: 확장 추론

# Models_ThinkingBudget.Header
source: Reasoning budget (tokens)
ko_kr: 추론 예산 (토큰)

# Models_MaxTokens.Header
source: Max tokens
ko_kr: 최대 토큰

# Models_ThinkingOverrideAuto
source: Auto
ko_kr: 자동

# Models_ThinkingOverrideForceOn
source: Force On
ko_kr: 강제 활성화

# Models_ThinkingOverrideForceOff
source: Force Off
ko_kr: 강제 비활성화

# Models_OllamaServerUrl.Text
source: Server URL
ko_kr: 서버 URL

# Models_OllamaLocalhost.Text
source: Reset to localhost
ko_kr: 로컬호스트로 초기화

# Models_OllamaTestConnection.Content
source: Test
ko_kr: 테스트

# Ollama_Error_ConnectionRefused
source: Could not connect to Ollama server. Check that it is running.
ko_kr: Ollama 서버에 연결할 수 없습니다. 서버가 실행 중인지 확인하세요.

# Ollama_Error_Timeout
source: Connection timed out. The server may be unreachable.
ko_kr: 연결 시간이 초과되었습니다. 서버에 접근할 수 없을 수 있습니다.

# Ollama_Error_HostNotFound
source: Host not found. Check the server address.
ko_kr: 호스트를 찾을 수 없습니다. 서버 주소를 확인하세요.

# Ollama_Error_NetworkUnreachable
source: Network unreachable. Check your network connection.
ko_kr: 네트워크에 접근할 수 없습니다. 네트워크 연결을 확인하세요.

# Ollama_Error_HttpError
source: Server returned an error.
ko_kr: 서버에서 오류가 반환되었습니다.

# Ollama_Error_Unknown
source: An unexpected error occurred.
ko_kr: 예기치 않은 오류가 발생했습니다.

# Nav_Connect.Content
source: Connect
ko_kr: 연동

# Nav_KnowledgeBases.Content
source: Knowledge Base
ko_kr: 지식베이스

# KB_Title.Text
source: Knowledge Base
ko_kr: 지식베이스

# KB_Create.Content
source: Create
ko_kr: 생성

# KB_Empty.Text
source: No knowledge bases yet.
ko_kr: 지식베이스가 없습니다.

# KB_EmptyHint.Text
source: Click Create to add one and start indexing your documents.
ko_kr: 생성 버튼을 눌러 문서를 인덱싱하고 검색할 수 있습니다.

# KB_SearchPlaceholder
source: Search knowledge bases...
ko_kr: 지식베이스 검색...

# KB_CreateDialogTitle
source: Create Knowledge Base
ko_kr: 지식베이스 생성

# KB_DeleteDialogTitle
source: Delete Knowledge Base
ko_kr: 지식베이스 삭제

# KB_DeleteDialogMessage
source: This will permanently delete the knowledge base and its index. This cannot be undone.
ko_kr: 지식베이스와 인덱스가 영구적으로 삭제됩니다. 이 작업은 취소할 수 없습니다.

# KB_DeleteFailedTitle
source: Cannot delete knowledge base
ko_kr: 지식베이스를 삭제할 수 없습니다

# KB_DeleteFailedMessage
source: The files are still in use. Try again after indexing finishes, or restart the app if the issue persists.
ko_kr: 파일이 아직 사용 중입니다. 인덱싱이 끝난 후 다시 시도하거나, 문제가 계속되면 앱을 재시작하세요.

# KB_DeleteFailedIndexingMessage
source: This knowledge base is currently being indexed. Try again after indexing finishes.
ko_kr: 이 지식베이스는 현재 인덱싱 중입니다. 인덱싱이 끝난 후 다시 시도하세요.

# KB_DeleteFailedIndexingProgress
source: Progress: {0} / {1} files
ko_kr: 진행 상황: {0} / {1} 파일 처리 중

# KB_StatusReady
source: Ready
ko_kr: 준비됨

# KB_StatusIndexing
source: Indexing
ko_kr: 인덱싱

# KB_StatusNoIndex
source: No index
ko_kr: 인덱스 없음

# KB_StatusStale
source: Prompt stale
ko_kr: 재인덱싱 필요

# KB_CheckChanges
source: Check changes
ko_kr: 변경 확인

# KB_NoChanges
source: No changes
ko_kr: 변경 없음

# KB_ChangesAdded
source: Added
ko_kr: 추가

# KB_ChangesModified
source: Modified
ko_kr: 수정

# KB_ChangesDeleted
source: Deleted
ko_kr: 삭제

# KB_ChangesFailed
source: Failed
ko_kr: 실패

# KB_NoMatches
source: No matches in this knowledge base
ko_kr: 이 지식베이스에 매치 없음

# KB_MatchSummary_Prefix
source: Matches
ko_kr: 매치

# KB_MatchSummary_None
source: No matches
ko_kr: 매치 없음

# KB_Checking
source: Checking...
ko_kr: 확인 중...

# KB_Reindex.Content
source: Re-index
ko_kr: 재인덱싱

# KB_Delete.Content
source: Delete
ko_kr: 삭제

# KB_FooterHint.Text
source: Knowledge bases continue indexing in the background after the app closes. Local embedding models may temporarily affect system responsiveness.
ko_kr: 지식베이스는 앱이 닫혀도 백그라운드에서 인덱싱됩니다. 임베딩 모델에 따라 시스템이 일시적으로 느려질 수 있습니다.

# KB_DialogName
source: Name
ko_kr: 이름

# KB_DialogSourceFolders
source: Source Folders
ko_kr: 소스 폴더

# KB_DialogAddFolder
source: Add Folder
ko_kr: 폴더 추가

# KB_DialogContextDisabled
source: Disabled
ko_kr: 사용 안 함

# KB_DialogNameHint
source: Auto-generated from folder name if empty
ko_kr: 비워두면 폴더명으로 자동 생성

# KB_ReindexDialogTitle
source: Re-index {0}
ko_kr: {0} 재인덱싱

# KB_ReindexWarning
source: Changing the model requires full re-indexing. The existing index will be deleted.
ko_kr: 모델을 변경하면 전체 재인덱싱이 필요합니다. 기존 인덱스는 삭제됩니다.

# KB_ReindexButton
source: Re-index
ko_kr: 재인덱싱

# KB_ModelCurrent
source: (current)
ko_kr: (현재)

# KB_ModelNotInstalled
source: (not installed)
ko_kr: (설치 안 됨)

# KB_PreflightFailureTitle
source: Cannot start re-indexing
ko_kr: 재인덱싱을 시작할 수 없습니다

# KB_PreflightEmbeddingUnavailable
source: Embedding model '{0}' is not available.
ko_kr: 임베딩 모델 '{0}'을(를) 사용할 수 없습니다.

# KB_PreflightContextualizerUnavailable
source: Contextualizer model '{0}' is not available.
ko_kr: 컨텍스트화 모델 '{0}'을(를) 사용할 수 없습니다.

# KB_StatusModelUnavailable
source: Model unavailable
ko_kr: 모델 사용 불가

# KB_CancelIndexing
source: Cancel indexing
ko_kr: 인덱싱 취소

# KB_FolderUsedWarning
source: This folder is also used in: {0}
ko_kr: 이 폴더는 {0}에서도 사용 중입니다.

# KB_SaveAndReindex
source: Save & Re-index
ko_kr: 저장 후 재인덱싱

# KB_Save
source: Save
ko_kr: 저장

# KB_Settings
source: Settings
ko_kr: 설정

# Connect_RagKbPageHint
source: Create, re-index, and delete in the Knowledge Base page.
ko_kr: 지식베이스 페이지에서 생성, 재인덱싱, 삭제할 수 있습니다.

# Connect_Title.Text
source: Connect
ko_kr: 연동

# Connect_Description.Text
source: Register MCP (Model Context Protocol) servers to extend AI capabilities with external tools. Connected servers provide tools that can be used during conversations.
ko_kr: MCP(Model Context Protocol) 서버를 등록하여 외부 도구로 AI 기능을 확장합니다. 연결된 서버의 도구는 대화 중에 사용할 수 있습니다.

# Connect_AddServer
source: Add Server
ko_kr: 서버 추가

# Connect_ImportFrom
source: Import from...
ko_kr: 가져오기...

# Connect_EmptyState
source: No MCP servers registered. Add a server or import from another application.
ko_kr: 등록된 MCP 서버가 없습니다. 서버를 추가하거나 다른 앱에서 가져오세요.

# Connect_AddServerDialog
source: Add MCP Server
ko_kr: MCP 서버 추가

# Connect_ServerName
source: Server Name
ko_kr: 서버 이름

# Connect_ServerDescription
source: Description (for AI)
ko_kr: 설명 (AI용)

# Connect_Transport
source: Transport
ko_kr: 전송 방식

# Connect_Command
source: Command
ko_kr: 명령어

# Connect_Arguments
source: Arguments
ko_kr: 인수

# Connect_EnvVars
source: Environment Variables (KEY=VALUE, one per line)
ko_kr: 환경 변수 (KEY=VALUE, 한 줄에 하나씩)

# Connect_ImportDialog
source: Import MCP Servers
ko_kr: MCP 서버 가져오기

# Connect_ImportComplete
source: Import Complete
ko_kr: 가져오기 완료

# Connect_ImportedCount
source: {0} server(s) imported.
ko_kr: {0}개 서버를 가져왔습니다.

# Connect_NoSourcesFound
source: No Sources Found
ko_kr: 소스 없음

# Connect_NoSourcesMessage
source: No MCP configurations were found from Claude Desktop, VS Code, or Claude Code.
ko_kr: Claude Desktop, VS Code, Claude Code에서 MCP 설정을 찾지 못했습니다.

# Connect_Edit
source: Edit
ko_kr: 편집

# Connect_Reconnect
source: Reconnect
ko_kr: 재연결

# Connect_Remove
source: Remove
ko_kr: 제거

# Connect_EditServerDialog
source: Edit MCP Server
ko_kr: MCP 서버 편집

# Connect_Disabled
source: Disabled
ko_kr: 비활성

# Connect_RestartRequired
source: Settings changed. Restarting {0}...
ko_kr: 설정이 변경되었습니다. {0} 재시작 중...

# Connect_Restarted
source: {0} restarted
ko_kr: {0} 재시작됨

# Connect_RestartFailed
source: Restart failed
ko_kr: 재시작 실패

# Connect_ServerRemoved
source: {0} removed
ko_kr: {0} 제거됨

# Connect_Tools
source: tools
ko_kr: 도구

# Connect_Servers
source: servers
ko_kr: 서버

# Connect_BuiltIn
source: Built-in
ko_kr: 내장

# Connect_FilesystemNeedsFolders
source: Add workspace folders in a conversation to activate.
ko_kr: 대화에서 작업 폴더를 추가하면 활성화됩니다.

# Connect_FilesystemActiveInstances
source: Managed per conversation.
ko_kr: 대화별로 관리됩니다.

# Connect_FilesystemActiveCount
source: {0} active instance(s)
ko_kr: 활성 인스턴스 {0}개

# Connect_CommandHint
source: Use a package runner (npx, uvx) or path to an executable. Build wrappers like dotnet run or cargo run add 5–10s to every startup.
ko_kr: 도구 명령어(예: npx, uvx, dnx, 또는 NuGet .NET 도구 명령어)를 입력하세요. .NET 패키지는 dnx를 권장합니다 — npx처럼 NuGet에서 받아 바로 실행하며 별도 설치 단계가 없습니다. 첫 인수에 패키지를 넘기세요, 예: FieldCure.Mcp.PublicData.Kr@1.* --yes. 기존 .NET 글로벌 도구는 첫 사용 시 자동 설치되며 NuGet 패키지명을 별도로 입력받습니다. dotnet run, cargo run 같은 빌드 래퍼는 매 시작이 5–10초 느려집니다.

# Connect_BuiltInDuplicate
source: This server is already managed as a built-in server.
ko_kr: 이 서버는 이미 내장 서버로 관리되고 있습니다.

# BuiltIn_InstallSuccess
source: {0} v{1} installed
ko_kr: {0} v{1} 설치 완료

# BuiltIn_InstallSuccessMessage
source: Add workspace folders in a conversation to start using it.
ko_kr: 대화에서 작업 폴더를 추가하면 사용할 수 있습니다.

# BuiltIn_Installing
source: Installing {0}…
ko_kr: {0} 설치 중…

# BuiltIn_Updating
source: Updating {0} v{1} → v{2}…
ko_kr: {0} v{1} → v{2} 업데이트 중…

# BuiltIn_Updated
source: {0} updated v{1} → v{2}
ko_kr: {0} v{1} → v{2} 업데이트 완료

# BuiltIn_InstallFailed
source: Failed to install {0}
ko_kr: {0} 설치 실패

# BuiltIn_InstallFailedMessage
source: Check your internet connection and try again.
ko_kr: 인터넷 연결을 확인하고 다시 시도하세요.

# BuiltIn_UpdatingProgress
source: Updating MCP packages ({0}/{1})
ko_kr: MCP 패키지 업데이트 중 ({0}/{1})

# BuiltIn_UpdateComplete
source: MCP packages updated
ko_kr: MCP 패키지 업데이트 완료

# BuiltIn_UpdateAvailable_Title
source: MCP package updates ready
ko_kr: MCP 패키지 업데이트 준비됨

# BuiltIn_UpdateAvailable_Body
source: {0} {1} → {2} and {3} more
ko_kr: {0} {1} → {2} 외 {3}개

# Profiles_EssentialsHint
source: Provides web access, command execution, file management, and more.
ko_kr: 웹 접근, 명령 실행, 파일 관리 등 기본 도구를 제공합니다.

# Profiles_MemoryHint
source: Remember and forget information across conversations
ko_kr: 대화 간 정보를 기억하고 잊을 수 있습니다

# Profiles_WorkspaceHint
source: Add workspace folders in conversations.
ko_kr: 대화에서 작업 폴더를 추가하세요.

# Profiles_WorkspaceSuppressHint
source: Essentials file tools are replaced by Workspace when enabled.
ko_kr: Workspace 활성 시 기본 도구의 파일 기능은 워크스페이스로 대체됩니다.

# Mcp_ServersConnecting
source: Connecting to {0} MCP server(s)…
ko_kr: MCP 서버 {0}개 연결 중…

# Mcp_ServersConnected
source: {0} MCP server(s) connected
ko_kr: MCP 서버 {0}개 연결됨

# Mcp_ServerReconnected
source: MCP server "{0}" reconnected
ko_kr: MCP 서버 "{0}" 재연결됨

source: MCP connection failed
ko_kr: MCP 연결 실패

# Mcp_Disconnecting
source: Disconnecting MCP servers, please wait...
ko_kr: MCP 서버 연결을 해제하고 있습니다. 잠시 기다려 주세요...

# TabContext_Close
source: Close
ko_kr: 닫기

# TabContext_CloseOthers
source: Close Others
ko_kr: 다른 탭 닫기

# TabContext_CloseRight
source: Close to the Right
ko_kr: 오른쪽 탭 닫기

# TabContext_CloseSaved
source: Close Saved
ko_kr: 저장된 탭 닫기

# TabContext_CopyFullPath
source: Copy Full Path
ko_kr: 전체 경로 복사

# TabContext_OpenFolder
source: Open Containing Folder
ko_kr: 폴더 열기

# TabContext_Rename
source: Rename
ko_kr: 이름 바꾸기

# TabContext_RenameDialog
source: Rename File
ko_kr: 파일 이름 변경

# MainMenu.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Menu
ko_kr: 메뉴

# McpCard_Edit.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Edit server
ko_kr: 서버 편집

# McpCard_Edit.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Edit
ko_kr: 편집

# McpCard_Reconnect.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Reconnect server
ko_kr: 서버 재연결
